old_projects/CapilarBridge/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          30000;
        startFace       59600;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          30000;
        startFace       89600;
    }
    tankWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       119600;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          300;
        startFace       119700;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          300;
        startFace       120000;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       120300;
    }
)

// ************************************************************************* //
