old_projects/CapilarBridge/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
     tankWall
     { 
           type            zeroGradient;
      }
     bottom
     { 
           type            zeroGradient;
      }
     top
     { 
           type            zeroGradient;
      }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
